import matplotlib.pyplot as plt
import numpy as np
from matplotlib import cm

# 横向柱形图
# 1. 生成数据
np.random.seed(20230811)
x = ['RBF-KELM', 'Poly-KELM', 'CNN-KELM', 'LSTM-KELM', 'RBF-MKELM', 'Poly-MKELM', 'MALK-ELM(G1)', 'MALK-ELM(G2)', 'MALK-ELM(G3)', 'MALK-ELM(GA)']
y1_acc = [0.7812, 0.7659, 0.7736, 0.7559, 0.8367, 0.8162, 0.8688, 0.8737, 0.8823, 0.9099]
y1_mf = [0.5934, 0.5413, 0.5736, 0.5595, 0.6122, 0.6003, 0.6060, 0.6102, 0.6772, 0.7380]
y1_fnr = [0.0435, 0.0247, 0.0252, 0.0226, 0.0299,  0.0293, 0.0102, 0.0005, 0.0072, 0.0061]
y2_acc = [0.8109, 0.8004, 0.8136, 0.8092, 0.8244, 0.8179, 0.8305, 0.8504, 0.8580, 0.8728]
y2_mf = [0.5646, 0.5328, 0.5688, 0.5463, 0.5882, 0.5665, 0.5996, 0.6063, 0.6274, 0.6420]
y2_fnr = [0.0136, 0.0232, 0.0244, 0.0113, 0.0297, 0.0148, 0.0279, 0.0065, 0.0095, 0.0065]
y3_acc = [0.8474, 0.8417, 0.8420, 0.8393, 0.8586, 0.8528, 0.8672, 0.8682, 0.8802, 0.8893]
y3_mf = [0.8288, 0.8202, 0.8197, 0.8168, 0.8405, 0.8316, 0.8505, 0.8507, 0.8628, 0.8735]
y3_fnr = [0.1412, 0.1390, 0.1360, 0.1419, 0.1260, 0.1234, 0.1197, 0.1138, 0.1083, 0.1037]
# 2. 创建画布
fig = plt.figure(figsize=(6, 4), dpi=100)
ax = fig.add_subplot(111)

# 3. 绘制柱形图
ax.barh(x, y3_fnr, height=0.5, color =['#d0d3ff','#b6bbff','#a0a6ff','#8991ff','#767eff','#656fff','#515cff','#3f4bff','#1f2eff','#0010ff'])
for i in range(len(y1_fnr)):

    ax.text(y3_fnr[i], i - 0.17, "%.2f" %(y3_fnr[i]*100) + '%')

# 4. 设置样式
ax.grid(axis='x', linestyle='--')
ax.set_axisbelow(True)
ax.spines[['right', 'top']].set_color('C7')
plt.xlim([0, 0.5])
plt.show()